c5/src/InformationRegisters/Ranges/Ranges.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Ranges</name>
  <resources>
    <name>Last</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Range</name>
    <type>
      <types>CatalogRef.Ranges</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

c5/src/Catalogs/Ranges/Ranges.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Ranges</name>
  <attributes>
    <name>Account</name>
    <type>
      <types>ChartOfAccountsRef.General</types>
    </type>
  </attributes>
  <attributes>
    <name>Capacity</name>
    <type>
      <types>DefinedType.Quantity</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Dim1</name>
    <type>
      <types>Characteristic.Dimensions</types>
    </type>
  </attributes>
  <attributes>
    <name>Dim2</name>
    <type>
      <types>Characteristic.Dimensions</types>
    </type>
  </attributes>
  <attributes>
    <name>Dim3</name>
    <type>
      <types>Characteristic.Dimensions</types>
    </type>
  </attributes>
  <attributes>
    <name>ExpenseAccount</name>
    <type>
      <types>ChartOfAccountsRef.General</types>
    </type>
  </attributes>
  <attributes>
    <name>Feature</name>
    <type>
      <types>CatalogRef.Features</types>
    </type>
  </attributes>
  <attributes>
    <name>Finish</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Item</name>
    <type>
      <types>CatalogRef.Items</types>
    </type>
  </attributes>
  <attributes>
    <name>Length</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Online</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Package</name>
    <type>
      <types>CatalogRef.Packages</types>
    </type>
  </attributes>
  <attributes>
    <name>Prefix</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Print</name>
    <type>
      <types>EnumRef.Print</types>
    </type>
  </attributes>
  <attributes>
    <name>Product</name>
    <type>
      <types>CatalogRef.Items</types>
    </type>
  </attributes>
  <attributes>
    <name>ProductFeature</name>
    <type>
      <types>CatalogRef.Features</types>
    </type>
  </attributes>
  <attributes>
    <name>Real</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Received</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Series</name>
    <type>
      <types>CatalogRef.Series</types>
    </type>
  </attributes>
  <attributes>
    <name>Source</name>
    <type>
      <types>CatalogRef.Ranges</types>
    </type>
  </attributes>
  <attributes>
    <name>Start</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Type</name>
    <type>
      <types>EnumRef.Forms</types>
    </type>
  </attributes>
</mdclass:Catalog>

c5/src/CommonModules/RunRanges/Module.bsl
Procedure SqlData ( Env ) export
	
	s = "
	|select Goods.LineNumber as LineNumber, Goods.Range as Range
	|into Ranges
	|from Items as Goods
	|where Goods.Range <> value ( Catalog.Ranges.EmptyRef )
	|index by Range
	|;
	|// #RangeErrors
	|select 1 as Error, Items.LineNumber as LineNumber
	|from Items as Items
	|where Items.Range = value ( Catalog.Ranges.EmptyRef )
	|and Items.Item.Form
	|union all
	|select 2, min ( Items.LineNumber )
	|from Items as Items
	|	//
	|	// Doubles
	|	//
	|	join Items as Doubles
	|	on Doubles.Range = Items.Range
	|	and Doubles.LineNumber <> Items.LineNumber
	|where Items.Range <> value ( Catalog.Ranges.EmptyRef )
	|group by Items.Range
	|";
	type = TypeOf ( Env.Ref );
	if ( type = Type ( "DocumentRef.VendorInvoice" )
		or type = Type ( "DocumentRef.ItemBalances" ) ) then
		s = s + "
		|union all
		|select 3, Items.LineNumber
		|from Items as Items
		|where Items.Range <> value ( Catalog.Ranges.EmptyRef )
		|and Items.Quantity <> ( 1 + Items.Range.Finish - Items.Range.Start )
		|";
	endif;
	s = s + "
	|;
	|// #RangeList
	|select Ranges.Range as Range
	|from Ranges as Ranges
	|";
	Env.Selection.Add ( s );
	
EndProcedure

Function Check ( Env ) export
	
	table = Env.RangeErrors;
	if ( table.Count () = 0 ) then
		return true;
	endif;
	ref = Env.Ref;
	qty = ? ( Options.Packages (), "QuantityPkg", "Quantity" );
	for each row in table do
		if ( row.Error = 1 ) then
			field = Output.Row ( "Items", row.LineNumber, "Item" );
			Output.RangeIsEmpty ( , field, ref );
		elsif ( row.Error = 2 ) then
			field = Output.Row ( "Items", row.LineNumber, "Item" );
			Output.RangeDoubled ( , field, ref );
		elsif ( row.Error = 3 ) then
			field = Output.Row ( "Items", row.LineNumber, qty );
			Output.RangeIncomplete ( , field, ref );
		endif;
	enddo;
	return false;
	
EndFunction

Function MakeReceipt ( Env ) export

	RunRanges.Lock ( Env );
	table = getRanges ( Env );
	locations = Env.Registers.RangeLocations;
	statuses = Env.Registers.RangeStatuses;
	ref = Env.Ref;
	date = Env.Fields.Date;
	error = false;
	for each row in table do
		if ( row.AlreadyInUse ) then
			error = true;
			p = new Structure ( "Range", row.Range );
			field = Output.Row ( "Items", row.LineNumber, "Item" );
			Output.RangeAlreadyInUse ( p, field, ref );
		else
			range = row.Range;
			movement = locations.Add ();
			movement.Period = date;
			movement.Range = range;
			movement.Warehouse = row.Warehouse;
			movement = statuses.Add ();
			movement.Period = date;
			movement.Range = range;
			movement.Status = Enums.RangeStatuses.Active;
		endif;
	enddo; 
	return not error;
	
EndFunction

Procedure Lock ( Env ) export
	
	table = Env.RangeList;
	lock = new DataLock ();
	item = lock.Add ( "InformationRegister.RangeStatuses" );
	item.Mode = DataLockMode.Exclusive;
	item.DataSource = table;
	item.UseFromDataSource ( "Range", "Range" );
	type = TypeOf ( Env.Ref );
	if ( type = Type ( "DocumentRef.WriteOff" )
		or type = Type ( "DocumentRef.Transfer" ) ) then
		item = lock.Add ( "InformationRegister.Ranges" );
		item.Mode = DataLockMode.Exclusive;
		item.DataSource = table;
		item.UseFromDataSource ( "Range", "Range" );
		item = lock.Add ( "InformationRegister.RangeLocations" );
		item.Mode = DataLockMode.Exclusive;
		item.DataSource = table;
		item.UseFromDataSource ( "Range", "Range" );
	endif;
	lock.Lock ();
	
EndProcedure

Function getRanges ( Env )
	
	s = "
	|// #Ranges
	|select Ranges.LineNumber as LineNumber, Ranges.Range as Range, Ranges.Warehouse,
	|	case when Statuses.Status is null then false else true end as AlreadyInUse
	|from Items as Ranges
	|	//
	|	// Statuses
	|	//
	|	left join InformationRegister.RangeStatuses.SliceLast ( &Period,
	|		Range in ( select Range from Ranges ) ) as Statuses
	|	on Statuses.Range = Ranges.Range
	|where Ranges.Range <> value ( Catalog.Ranges.EmptyRef )
	|";
	Env.Selection.Add ( s );
	SQL.Prepare ( Env );
	period = ? ( Env.Realtime, undefined, new Boundary ( Env.Fields.Timestamp, BoundaryType.Excluding ) );
	q = Env.Q;
	q.SetParameter ( "Period", period );
	return q.Execute ().Unload ();
	
EndFunction
